{"class_name": "Functional", "config": {"name": "functional_15", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_layer_input"}, "name": "dense_layer_input", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_layer", "trainable": true, "batch_input_shape": [null, 100], "dtype": "float32", "units": 2, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_layer", "inbound_nodes": [[["dense_layer_input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output_for_inference", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output_for_inference", "inbound_nodes": [[["dense_layer", 0, 0, {}]]]}], "input_layers": [["dense_layer_input", 0, 0]], "output_layers": [["output_for_inference", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}