{"class_name": "Functional", "config": {"name": "functional_33", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "Input_rings"}, "name": "Input_rings", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 6], "dtype": "float32", "sparse": false, "ragged": false, "name": "Input_shower_shapes"}, "name": "Input_shower_shapes", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "Input_track_variables"}, "name": "Input_track_variables", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_rings_layer", "trainable": true, "dtype": "float32", "units": 5, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_rings_layer", "inbound_nodes": [[["Input_rings", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_shower_layer", "trainable": true, "dtype": "float32", "units": 5, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_shower_layer", "inbound_nodes": [[["Input_shower_shapes", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_track_variables_layer", "trainable": true, "dtype": "float32", "units": 5, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_track_variables_layer", "inbound_nodes": [[["Input_track_variables", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate", "inbound_nodes": [[["dense_rings_layer", 0, 0, {}], ["dense_shower_layer", 0, 0, {}], ["dense_track_variables_layer", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_layer", "trainable": true, "dtype": "float32", "units": 5, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_layer", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output_for_inference", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output_for_inference", "inbound_nodes": [[["dense_layer", 0, 0, {}]]]}], "input_layers": [["Input_rings", 0, 0], ["Input_shower_shapes", 0, 0], ["Input_track_variables", 0, 0]], "output_layers": [["output_for_inference", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}